Revit 2024 API
CurveArrayIterator Constructor
For Internal Use Only.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public CurveArrayIterator()
Visual Basic
Public Sub New
Visual C++
public:
CurveArrayIterator()
Remarks
This constructor is exposed to enable support for COM interop only. This object should never be created by the developer.
See Also
CurveArrayIterator Class
Autodesk.Revit.DB Namespace